In [1]:
import pandas as pd
import numpy as np
import datetime
import warnings
import matplotlib.pyplot as plt
import seaborn as sns

warnings.filterwarnings('ignore')

In [2]:
data = pd.read_csv('learningSet.csv')

In [3]:
data.shape

(95412, 481)

In [4]:
#Check for null values in all the columns

In [5]:
data.isnull().sum()

ODATEDW       0
OSOURCE       0
TCODE         0
STATE         0
ZIP           0
           ...
MDMAUD_R      0
MDMAUD_F      0
MDMAUD_A      0
CLUSTER2    132
GEOCODE2    132
Length: 481, dtype: int64

In [6]:
#Exclude the following variables by looking at the definitions. Create a new empty list called drop_list. We will append this list and then drop all the columns in this list later:

#OSOURCE - symbol definitions not provided, too many categories
#ZIP CODE - we are including state already

In [7]:
drop_list = ['OSOURCE', 'ZIP']

In [8]:
#Identify columns that over 85% missing values

In [9]:
nulls = data.isna().sum().sort_values(ascending = False)*100/len(data)
nulls = nulls.reset_index()

In [10]:
nulls.columns = ['column_name', 'percent']

In [11]:
nulls

    column_name    percent
0       RDATE_5  99.990567
1       RAMNT_5  99.990567
2       RDATE_3  99.746363
3       RAMNT_3  99.746363
4       RDATE_4  99.705488
..          ...        ...
476       ETHC3   0.000000
477       ETHC2   0.000000
478       ETHC1   0.000000
479       HHD12   0.000000
480       TPE11   0.000000

[481 rows x 2 columns]

In [12]:
nulls=nulls.query("percent > 85")

In [13]:
nulls

   column_name    percent
0      RDATE_5  99.990567
1      RAMNT_5  99.990567
2      RDATE_3  99.746363
3      RAMNT_3  99.746363
4      RDATE_4  99.705488
5      RAMNT_4  99.705488
6      RAMNT_6  99.186685
7      RDATE_6  99.186685
8     RAMNT_15  92.388798
9     RDATE_15  92.388798
10    RDATE_23  91.763091
11    RAMNT_23  91.763091
12    RDATE_20  91.732696
13    RAMNT_20  91.732696
14     RAMNT_7  90.677273
15     RDATE_7  90.677273
16    RAMNT_17  90.146942
17    RDATE_17  90.146942
18    RDATE_21  90.029556
19    RAMNT_21  90.029556
20    RAMNT_10  89.035970
21    RDATE_10  89.035970
22    RDATE_13  87.160944
23    RAMNT_13  87.160944
24     NUMCHLD  87.018404

In [14]:
nulls['column_name']

0      RDATE_5
1      RAMNT_5
2      RDATE_3
3      RAMNT_3
4      RDATE_4
5      RAMNT_4
6      RAMNT_6
7      RDATE_6
8     RAMNT_15
9     RDATE_15
10    RDATE_23
11    RAMNT_23
12    RDATE_20
13    RAMNT_20
14     RAMNT_7
15     RDATE_7
16    RAMNT_17
17    RDATE_17
18    RDATE_21
19    RAMNT_21
20    RAMNT_10
21    RDATE_10
22    RDATE_13
23    RAMNT_13
24     NUMCHLD
Name: column_name, dtype: object

In [15]:
#Remove those columns from the dataframe

In [16]:
columns=['RDATE_5', 'RAMNT_5'
,'RDATE_3'
,      'RAMNT_3'
,      'RDATE_4'
,      'RAMNT_4'
,      'RAMNT_6'
,      'RDATE_6'
,     'RAMNT_15'
,     'RDATE_15'
,    'RDATE_23'
,    'RAMNT_23'
,    'RDATE_20'
,    'RAMNT_20'
,     'RAMNT_7'
,     'RDATE_7'
,    'RAMNT_17'
,    'RDATE_17'
,    'RDATE_21'
,    'RAMNT_21'
,    'RAMNT_10'
,    'RDATE_10'
,    'RDATE_13'
,    'RAMNT_13'
,     'NUMCHLD']

In [17]:
data.drop(columns, inplace=True, axis=1)

In [18]:
data.columns

Index(['ODATEDW', 'OSOURCE', 'TCODE', 'STATE', 'ZIP', 'MAILCODE', 'PVASTATE',
       'DOB', 'NOEXCH', 'RECINHSE',
       ...
       'TARGET_D', 'HPHONE_D', 'RFA_2R', 'RFA_2F', 'RFA_2A', 'MDMAUD_R',
       'MDMAUD_F', 'MDMAUD_A', 'CLUSTER2', 'GEOCODE2'],
      dtype='object', length=456)

In [20]:
print(data['GENDER'].value_counts())

F    51277
M    39094
      2957
U     1715
J      365
C        2
A        2
Name: GENDER, dtype: int64

In [21]:
#Reduce the number of categories in the column GENDER. The column should only have either "M" for males, "F" for females, and "other" for all the rest

#Note that there are a few null values in the column. We will first replace those null values using the code below:
data['GENDER'] = data['GENDER'].fillna('F')

In [22]:
print(data['GENDER'].value_counts())

F    51277
M    39094
      2957
U     1715
J      365
C        2
A        2
Name: GENDER, dtype: int64

In [28]:
data['GENDER'] = data['GENDER'].replace([" ", "U", "J", "C", "A"],'OTHER')

In [29]:
print(data['GENDER'].value_counts())

F        51277
M        39094
OTHER     5041
Name: GENDER, dtype: int64